## **PROJECT - NOTEBOOK #1: Raw Data**

> ðŸš§ Run this notebook only once to migrate the data to your DB (It will take a few minutes)

This notebook sets up our data pipeline by configuring the environment, importing essential libraries and create a SQLAlchemy engine, then loading raw data from the CSV file into a Pandas DataFrame, transferring this data into a MySQL database, and verifying the transfer with a simple query.

---

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.set_option('display.float_format', '{:.2f}'.format)

In [4]:
df_postings = pd.read_csv('../data/postings.csv')

In [5]:
df_postings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123849 entries, 0 to 123848
Data columns (total 31 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   job_id                      123849 non-null  int64
 1   company_name                122130 non-null  object
 2   title                       123849 non-null  object
 3   description                 123842 non-null  object
 4   max_salary                  29793 non-null   float64
 5   pay_period                  36073 non-null   object
 6   location                    123849 non-null  object
 7   company_id                  122132 non-null  float64
 8   views                       122160 non-null  float64
 9   med_salary                  6280 non-null    float64
 10  min_salary                  29793 non-null   float64
 11  formatted_work_type         123849 non-null  object
 12  applies                     23320 non-null   float64
 13  original_listed_time        123849 non-null  float64
 14  remote_allowed              15246 non-null   float64
 15  job_posting_url             123849 non-null  object
 16  application_url             87184 non-null   object
 17  application_type            123849 non-null  object
 18  expiry                      123849 non-null  float64
 19  closed_time                 1073 non-null    float64
 20  formatted_experience_level  94440 non-null   object
 21  skills_desc                 2439 non-null    object
 22  listed_time                 123849 non-null  float64
 23  posting_domain              83881 non-null   object
 24  sponsored                   123849 non-null  int64
 25  work_type                   123849 non-null  object
 26  currency                    36073 non-null   object
 27  compensation_type           36073 non-null   object
 28  normalized_salary           36073 non-null   float64
 29  zip_code                    102977 non-null  float64
 30  fips                        96434 non-null   float64
dtypes: float64(14), int64(2), object(15)
memory usage: 29.3+ MB

In [6]:
df_postings.describe()

,job_id,max_salary,company_id,views,med_salary,min_salary,applies,original_listed_time,remote_allowed,expiry,closed_time,listed_time,sponsored,normalized_salary,zip_code,fips
count,123849.00,29793.00,122132.00,122160.00,6280.00,29793.00,23320.00,123849.00,15246.00,123849.00,1073.00,123849.00,123849.00,36073.00,102977.00,96434.00
mean,3896402138.07,91939.42,12204012.34,14.62,22015.62,64910.85,10.59,1713152338799.94,1.00,1716213036608.15,1712927892086.67,1713204445996.68,0.00,205327.04,50400.49,28713.88
std,84043545.16,701110.14,25541431.66,85.90,52255.87,495973.79,29.05,484820878.41,0.00,2321393898.08,362289347.41,398912198.59,0.00,5097626.76,30252.23,16015.93
min,921716.00,1.00,1009.00,1.00,0.00,1.00,1.00,1701810533000.00,1.00,1712903448000.00,1712345932000.00,1711317014000.00,0.00,0.00,1001.00,1003.00
25%,3894586595.00,48.28,14352.00,3.00,18.94,37.00,1.00,1712862876000.00,1.00,1715480718000.00,1712669760000.00,1712885544000.00,0.00,52000.00,24112.00,13121.00
50%,3901998406.00,80000.00,226965.00,4.00,25.50,60000.00,3.00,1713395039000.00,1.00,1716042264000.00,1712669910000.00,1713407593000.00,0.00,81500.00,48059.00,29183.00
75%,3904707077.00,140000.00,8047188.00,8.00,2510.50,100000.00,8.00,1713478324000.00,1.00,1716088229000.00,1713282569000.00,1713483628000.00,0.00,125000.00,78201.00,42077.00
max,3906267224.00,120000000.00,103472979.00,9975.00,750000.00,85000000.00,967.00,1713572803000.00,1.00,1729124796000.00,1713562107000.00,1713572816000.00,0.00,535600000.00,99901.00,56045.00

In [7]:
df_postings.head()

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.00,HOURLY,"Princeton, NJ",2774458.00,20.00,NaN,...,Requirements: \n\nWe are seeking a College or ...,1713397508000.00,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.00,8540.00,34021.00
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.00,HOURLY,"Fort Collins, CO",NaN,1.00,NaN,...,NaN,1712857887000.00,NaN,0,FULL_TIME,USD,BASE_SALARY,83200.00,80521.00,8069.00
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.00,YEARLY,"Cincinnati, OH",64896719.00,8.00,NaN,...,We are currently accepting resumes for FOH - A...,1713277614000.00,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.00,45202.00,39061.00
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.00,YEARLY,"New Hyde Park, NY",766262.00,16.00,NaN,...,This position requires a baseline understandin...,1712895812000.00,NaN,0,FULL_TIME,USD,BASE_SALARY,157500.00,11040.00,36059.00
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.00,YEARLY,"Burlington, IA",NaN,3.00,NaN,...,NaN,1713451943000.00,NaN,0,FULL_TIME,USD,BASE_SALARY,70000.00,52601.00,19057.00

In [8]:
missing_counts = df_postings.isna().sum()
missing_perc   = (missing_counts / len(df_postings) * 100).round(2)
pd.DataFrame({
    'missing_count': missing_counts,
    'missing_perc':   missing_perc
})

                            missing_count  missing_perc
job_id                                  0          0.00
company_name                         1719          1.39
title                                   0          0.00
description                             7          0.01
max_salary                          94056         75.94
pay_period                          87776         70.87
location                                0          0.00
company_id                           1717          1.39
views                                1689          1.36
med_salary                         117569         94.93
min_salary                          94056         75.94
formatted_work_type                     0          0.00
applies                            100529         81.17
original_listed_time                    0          0.00
remote_allowed                     108603         87.69
job_posting_url                         0          0.00
application_url                     36665         29.60
application_type                        0          0.00
expiry                                  0          0.00
closed_time                        122776         99.13
formatted_experience_level          29409         23.75
skills_desc                        121410         98.03
listed_time                             0          0.00
posting_domain                      39968         32.27
sponsored                               0          0.00
work_type                               0          0.00
currency                            87776         70.87
compensation_type                   87776         70.87
normalized_salary                   87776         70.87
zip_code                            20872         16.85
fips                                27415         22.14

In [9]:
percentiles = [0.01, 0.05, 0.25, 0.50, 0.75, 0.95, 0.99]
cols = ['min_salary', 'max_salary', 'med_salary', 'normalized_salary', 'views', 'applies']
df_postings[cols].quantile(percentiles)

      min_salary  max_salary  med_salary  normalized_salary  views  applies
0.01       13.92       16.00       12.00             130.00   1.00     1.00
0.05       16.70       20.00       15.00           33280.00   2.00     1.00
0.25       37.00       48.28       18.94           52000.00   3.00     1.00
0.50    60000.00    80000.00       25.50           81500.00   4.00     3.00
0.75   100000.00   140000.00     2510.50          125000.00   8.00     8.00
0.95   166080.00   245000.00   120000.00          200000.00  48.00    45.00
0.99   247696.80   352148.00   225000.00          300808.00 177.00   133.81

In [10]:
print("Duplicated:", df_postings.duplicated().sum())

Duplicated: 0

In [11]:
cat_cols = [
    'pay_period',
    'formatted_work_type',
    'application_type',
    'work_type',
    'formatted_experience_level',
    'currency',
    'compensation_type'
]

for col in cat_cols:
    print(f"=== {col} ===")
    print(df_postings[col].value_counts(dropna=False).head(10))
    print()

=== pay_period ===
NaN         87776
YEARLY      20628
HOURLY      14741
MONTHLY       518
WEEKLY        177
BIWEEKLY        9
Name: pay_period, dtype: int64

=== formatted_work_type ===
Full-time     98814
Contract      12117
Part-time      9696
Temporary      1190
Internship      983
Volunteer       562
Other           487
Name: formatted_work_type, dtype: int64

=== application_type ===
OffsiteApply          84607
ComplexOnsiteApply    31049
SimpleOnsiteApply      8192
UnknownApply              1
Name: application_type, dtype: int64

=== work_type ===
FULL_TIME     98814
CONTRACT      12117
PART_TIME      9696
TEMPORARY      1190
INTERNSHIP      983
VOLUNTEER       562
OTHER           487
Name: work_type, dtype: int64

=== formatted_experience_level ===
Mid-Senior level    41489
Entry level         36708
NaN                 29409
Associate            9826
Director             3746
Internship           1449
Executive            1222
Name: formatted_experience_level, dtype: int64

=== currency ===
NaN    87776
USD    36058
EUR        6
CAD        3
BBD        2
AUD        2
GBP        2
Name: currency, dtype: int64

=== compensation_type ===
NaN            87776
BASE_SALARY    36073
Name: compensation_type, dtype: int64

In [12]:
top_locations = df_postings['location'].value_counts().head(20)
print("=== Top 20 locations ===")
print(top_locations)

# Remote allowed
remote_counts = df_postings['remote_allowed'].value_counts(dropna=False)
remote_pct = (remote_counts.get(1.0, 0) / len(df_postings) * 100).round(2)
print("\n=== Remote allowed counts ===")
print(remote_counts)
print(f"\nRemote allowed % of total postings: {remote_pct}%")

=== Top 20 locations ===
United States                      8125
New York, NY                       2756
Chicago, IL                        1834
Houston, TX                        1762
Dallas, TX                         1383
Atlanta, GA                        1363
Boston, MA                         1176
Austin, TX                         1083
Charlotte, NC                      1075
Phoenix, AZ                        1059
Washington, DC                      985
Los Angeles, CA                     972
San Francisco, CA                   884
New York City Metropolitan Area     837
Seattle, WA                         818
San Diego, CA                       790
Denver, CO                          787
Philadelphia, PA                    711
Tampa, FL                           659
Miami, FL                           643
Name: location, dtype: int64

=== Remote allowed counts ===
NaN     108603
1.00     15246
Name: remote_allowed, dtype: int64

Remote allowed % of total postings: 12.31%

In [13]:
df_benefits = pd.read_csv('../data/jobs/benefits.csv')
df_benefits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67943 entries, 0 to 67942
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   job_id    67943 non-null  int64
 1   inferred  67943 non-null  int64
 2   type      67943 non-null  object
dtypes: int64(2), object(1)
memory usage: 1.6+ MB

In [14]:
print("Duplicados:", df_benefits.duplicated().sum())

Duplicados: 0

In [15]:
df_benefits.describe()

             job_id  inferred
count      67943.00  67943.00
mean  3896219574.65      0.59
std     98172917.62      0.49
min     23221523.00      0.00
25%   3898160860.00      0.00
50%   3902347593.00      1.00
75%   3904718586.50      1.00
max   3906267117.00      1.00

In [16]:
df_benefits.isna().sum()

job_id      0
inferred    0
type        0
dtype: int64

In [17]:
df_job_industries = pd.read_csv('../data/jobs/job_industries.csv')
df_job_industries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164808 entries, 0 to 164807
Data columns (total 2 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   job_id       164808 non-null  int64
 1   industry_id  164808 non-null  int64
dtypes: int64(2)
memory usage: 2.5 MB

In [18]:
print("Duplicados:", df_job_industries.duplicated().sum())

Duplicados: 0

In [19]:
df_job_industries.describe()

             job_id  industry_id
count     164808.00    164808.00
mean  3897074144.95       196.16
std     76249300.50       594.23
min       921716.00         1.00
25%   3894876310.00        17.00
50%   3902342291.50        44.00
75%   3904718771.25        96.00
max   3906267224.00      3253.00

In [20]:
df_job_industries.isna().sum()

job_id         0
industry_id    0
dtype: int64

In [21]:
df_job_skills = pd.read_csv('../data/jobs/job_skills.csv')
df_job_skills.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213768 entries, 0 to 213767
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   job_id     213768 non-null  int64
 1   skill_abr  213768 non-null  object
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [22]:
print("Duplicados:", df_job_skills.duplicated().sum())

Duplicados: 0

In [23]:
df_job_skills.describe()

             job_id
count     213768.00
mean  3896849267.04
std     78349015.80
min       921716.00
25%   3894660713.25
50%   3902323142.50
75%   3904715490.00
max   3906267224.00

In [24]:
df_job_skills.isna().sum()

job_id       0
skill_abr    0
dtype: int64

In [25]:
df_salaries = pd.read_csv('../data/jobs/salaries.csv')
df_salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40785 entries, 0 to 40784
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   salary_id          40785 non-null  int64
 1   job_id             40785 non-null  int64
 2   max_salary         33947 non-null  float64
 3   med_salary         6838 non-null   float64
 4   min_salary         33947 non-null  float64
 5   pay_period         40785 non-null  object
 6   currency           40785 non-null  object
 7   compensation_type  40785 non-null  object
dtypes: float64(3), int64(2), object(3)
memory usage: 2.5+ MB

In [26]:
df_salaries.describe()

       salary_id        job_id   max_salary  med_salary  min_salary
count   40785.00      40785.00     33947.00     6838.00    33947.00
mean    20393.00 3895563848.87     96209.87    21370.30    65085.41
std     11773.76   94966718.00    658737.34    51338.56   465061.24
min         1.00     921716.00         1.00        0.00        1.00
25%     10197.00 3894608085.00        50.00       18.50       39.00
50%     20393.00 3901980104.00     85000.00       25.00    62300.00
75%     30589.00 3904576109.00    142500.00     2207.00   100000.00
max     40785.00 3906267224.00 120000000.00   750000.00 85000000.00

In [27]:
df_salaries.isna().sum()

salary_id                0
job_id                   0
max_salary            6838
med_salary           33947
min_salary            6838
pay_period               0
currency                 0
compensation_type        0
dtype: int64

In [28]:
n_rows       = len(df_salaries)
n_unique_sid = df_salaries['salary_id'].nunique()
print(f"Rows: {n_rows}, Unique salary_id: {n_unique_sid}")

Rows: 40785, Unique salary_id: 40785

In [29]:
df_companies = pd.read_csv('../data/companies/companies.csv')
df_companies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24473 entries, 0 to 24472
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_id    24473 non-null  int64
 1   name          24473 non-null  object
 2   description   24177 non-null  object
 3   company_size  21699 non-null  float64
 4   state         24451 non-null  object
 5   country       24473 non-null  object
 6   city          24472 non-null  object
 7   zip_code      24445 non-null  object
 8   address       24451 non-null  object
 9   url           24473 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 1.9+ MB

In [30]:
print("Duplicados:", df_companies.duplicated().sum())

Duplicados: 0

In [31]:
df_companies.describe()

        company_id  company_size
count     24473.00      21699.00
mean   20522391.62          3.35
std    31659289.15          1.90
min        1009.00          1.00
25%      165404.00          2.00
50%     2738154.00          3.00
75%    26241420.00          5.00
max   103472979.00          7.00

In [32]:
df_companies.isna().sum()

company_id         0
name               0
description      296
company_size    2774
state             22
country            0
city               1
zip_code          28
address           22
url                0
dtype: int64

In [33]:
print("Duplicados:", df_companies.duplicated().sum())

Duplicados: 0

In [34]:
df_emp_counts = pd.read_csv('../data/companies/employee_counts.csv')
df_emp_counts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35787 entries, 0 to 35786
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_id      35787 non-null  int64
 1   employee_count  35787 non-null  int64
 2   follower_count  35787 non-null  int64
 3   time_recorded   35787 non-null  int64
dtypes: int64(4)
memory usage: 1.1 MB

In [35]:
df_emp_counts.describe()

        company_id  employee_count  follower_count  time_recorded
count     35787.00        35787.00        35787.00       35787.00
mean   16682540.69         6715.87       201261.63  1713163272.62
std    29247215.54        29400.98      1114732.82      399086.90
min        1009.00            0.00            0.00  1712346173.00
25%       60596.50           56.00         2738.00  1712861427.00
50%     1339209.00          418.00        16178.00  1713393030.00
75%    15440915.00         2945.00        74129.50  1713471600.00
max   103472979.00       751125.00     32702835.00  1713572859.00

In [36]:
df_emp_counts.isna().sum()

company_id        0
employee_count    0
follower_count    0
time_recorded     0
dtype: int64

In [37]:
print("Duplicados:", df_emp_counts.duplicated().sum())

Duplicados: 0

In [38]:
df_industries = pd.read_csv('../data/mappings/industries.csv')
df_industries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 422 entries, 0 to 421
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   industry_id    422 non-null    int64
 1   industry_name  388 non-null    object
dtypes: int64(1), object(1)
memory usage: 6.7+ KB

In [39]:
print("Duplicados:", df_industries.duplicated().sum())

Duplicados: 0

In [40]:
df_industries.describe()

       industry_id
count       422.00
mean       1342.31
std        1212.02
min           1.00
25%         108.25
50%        1161.50
75%        2279.50
max        3253.00

In [41]:
df_industries.isna().sum()

industry_id       0
industry_name    34
dtype: int64

In [42]:
df_skills = pd.read_csv('../data/mappings/skills.csv')
df_skills.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   skill_abr   35 non-null     object
 1   skill_name  35 non-null     object
dtypes: object(2)
memory usage: 692.0+ bytes

In [43]:
df_skills.describe()

       skill_abr    skill_name
count         35            35
unique        35            35
top          ART  Art/Creative
freq           1             1

In [44]:
df_skills.isna().sum()

skill_abr     0
skill_name    0
dtype: int64

In [45]:
dfs = {
    'postings': df_postings,
    'benefits': df_benefits,
    'job_industries': df_job_industries,
    'job_skills': df_job_skills,
    'salaries': df_salaries
}

total_postings = df_postings['job_id'].nunique()
coverage = []
for name, df in dfs.items():
    if 'job_id' in df.columns:
        n_records = len(df)
        n_unique = df['job_id'].nunique()
        pct = (n_unique / total_postings * 100)
        coverage.append({
            'dataset':      name,
            'rows':         n_records,
            'unique_job_id':n_unique,
            '% of postings': pct
        })

print(pd.DataFrame(coverage))

          dataset    rows  unique_job_id  % of postings
0        postings  123849         123849         100.00
1        benefits   67943          30023          24.24
2  job_industries  164808         127125         102.65
3      job_skills  213768         126807         102.39
4        salaries   40785          40785          32.93

In [46]:
dfs_comp = {
    'postings': df_postings,
    'companies': df_companies,
    'employee_counts': df_emp_counts
}

total_companies = df_companies['company_id'].nunique()
comp_cov = []
for name, df in dfs_comp.items():
    n_records = len(df)
    n_unique = df['company_id'].nunique()
    pct = (n_unique / total_companies * 100)
    comp_cov.append({
        'dataset':         name,
        'rows':            n_records,
        'unique_company':  n_unique,
        '% of companies':  pct
    })

print(pd.DataFrame(comp_cov))

           dataset    rows  unique_company  % of companies
0         postings  123849           24474          100.00
1        companies   24473           24473          100.00
2  employee_counts   35787           24473          100.00

In [47]:
print("=== pay_period en postings vs salaries ===")
print(df_postings['pay_period'].value_counts(dropna=False))
print(df_salaries['pay_period'].value_counts(dropna=False))

print("\n=== currency en postings vs salaries ===")
print(df_postings['currency'].value_counts(dropna=False))
print(df_salaries['currency'].value_counts(dropna=False))

=== pay_period en postings vs salaries ===
NaN         87776
YEARLY      20628
HOURLY      14741
MONTHLY       518
WEEKLY        177
BIWEEKLY        9
Name: pay_period, dtype: int64
YEARLY      23768
HOURLY      16289
MONTHLY       539
WEEKLY        180
BIWEEKLY        9
Name: pay_period, dtype: int64

=== currency en postings vs salaries ===
NaN    87776
USD    36058
EUR        6
CAD        3
BBD        2
AUD        2
GBP        2
Name: currency, dtype: int64
USD    40770
EUR        6
CAD        3
BBD        2
AUD        2
GBP        2
Name: currency, dtype: int64

In [48]:
print("=== Unique industry_id en job_industries vs industries ===")
print("job_industries:", df_job_industries['industry_id'].nunique())
print("industries   :", df_industries['industry_id'].nunique())

print("\n=== Unique skill_abr en job_skills vs skills ===")
print("job_skills:", df_job_skills['skill_abr'].nunique())
print("skills    :", df_skills['skill_abr'].nunique())

=== Unique industry_id en job_industries vs industries ===
job_industries: 422
industries   : 422

=== Unique skill_abr en job_skills vs skills ===
job_skills: 35
skills    : 35

In [51]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://root:root@localhost:5432/linkedin')

files = {
    'postings':       '../data/postings.csv',
    'benefits':       '../data/jobs/benefits.csv',
    'job_industries': '../data/jobs/job_industries.csv',
    'job_skills':     '../data/jobs/job_skills.csv',
    'salaries':       '../data/jobs/salaries.csv',
    'companies':      '../data/companies/companies.csv',
    'employee_counts':'../data/companies/employee_counts.csv',
    'industries':     '../data/mappings/industries.csv',
    'skills':         '../data/mappings/skills.csv'
}

for table, path in files.items():
    df = pd.read_csv(path)
    df.to_sql(
        name=table,
        con=engine,
        schema='raw',
        if_exists='replace',
        index=False
    )
    print(f"Cargado raw.{table}")

Cargado raw.postings
Cargado raw.benefits
Cargado raw.job_industries
Cargado raw.job_skills
Cargado raw.salaries
Cargado raw.companies
Cargado raw.employee_counts
Cargado raw.industries
Cargado raw.skills